sterentev/atdf-device-asm-include/inc/ATmega32HVBrevB.inc
; ====	BANDGAP MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register BGCSR bits		------------------------
.equ	BGD		= 5		; 0x20 - Bandgap Disable
.equ	BGSCDE		= 4		; 0x10 - Bandgap Short Circuit Detection Enabled
.equ	BGSCDIF		= 1		; 0x02 - Bandgap Short Circuit Detection Interrupt Flag
.equ	BGSCDIE		= 0		; 0x01 - Bandgap Short Circuit Detection Interrupt Enable

; ----------	Register BGCCR bits		------------------------
.equ	BGCC_MASK	= 0x3F		;      - BG Calibration of PTAT Current Bits (6 bits)
.equ	BGCC0		= 0		;          BGCC BIT0 position



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
.equ	CKOE		= 5		; 0x20 - Clock Output Enable
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

; ----------	Register MCUSR bits		------------------------
.equ	OCDRF		= 4		; 0x10 - OCD Reset Flag
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BODRF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register OSICSR bits		------------------------
.equ	OSISEL0		= 4		; 0x10 - Oscillator Sampling Interface Select 0
.equ	OSIST		= 1		; 0x02 - Oscillator Sampling Interface Status
.equ	OSIEN		= 0		; 0x01 - Oscillator Sampling Interface Enable

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC
;			0x04		; Reserved
;			0x06		; Power Save
;			0x08		; Power Off
;			0x0A		; Reserved
;			0x0C		; Reserved
;			0x0E		; Reserved

; ----------	Register DIDR0 bits		------------------------
.equ	PA1DID		= 1		; 0x02 - When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled.
.equ	PA0DID		= 0		; 0x01 - When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled.

; ----------	Register PRR0 bits		------------------------
.equ	PRTWI		= 6		; 0x40 - Power Reduction TWI
.equ	PRVRM		= 5		; 0x20 - Power Reduction Voltage Regulator Monitor
.equ	PRSPI		= 3		; 0x08 - Power reduction SPI
.equ	PRTIM1		= 2		; 0x04 - Power Reduction Timer/Counter1
.equ	PRTIM0		= 1		; 0x02 - Power Reduction Timer/Counter0
.equ	PRVADC		= 0		; 0x01 - Power Reduction V-ADC

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - Clock Prescaler Change Enable
.equ	CLKPS_MASK	= 0x03		;      - Clock Prescaler Select Bits (2 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position



; ====	BOOT_LOAD MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read-While-Write Section Busy
.equ	SIGRD		= 5		; 0x20 - Signature Row Read
.equ	RWWSRE		= 4		; 0x10 - Read-While-Write Section Read Enable
.equ	LBSET		= 3		; 0x08 - Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64
; ::::  CLK_SEL_3BIT_EXT	:::: values
;			0b000		; No Clock Source (Stopped)
;			0b001		; Running, No Prescaling
;			0b010		; Running, CLK/8
;			0b011		; Running, CLK/64
;			0b100		; Running, CLK/256
;			0b101		; Running, CLK/1024
;			0b110		; Running, ExtClk Tn Falling Edge
;			0b111		; Running, ExtClk Tn Rising Edge



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 29
.equ	INT_VECTORS_SIZE	= 0x3A
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;	1	BPINT		; Battery Protection Interrupt
;	2	VREGMON		; Voltage regulator monitor interrupt
;	3	INT0		; External Interrupt Request 0
;	4	INT1		; External Interrupt Request 1
;	5	INT2		; External Interrupt Request 2
;	6	INT3		; External Interrupt Request 3
;	7	PCINT0		; Pin Change Interrupt 0
;	8	PCINT1		; Pin Change Interrupt 1
;	9	WDT		; Watchdog Timeout Interrupt
;	10	BGSCD		; Bandgap Buffer Short Circuit Detected
;	11	CHDET		; Charger Detect
;	12	TIMER1_IC	; Timer 1 Input capture
;	13	TIMER1_COMPA	; Timer 1 Compare Match A
;	14	TIMER1_COMPB	; Timer 1 Compare Match B
;	15	TIMER1_OVF	; Timer 1 overflow
;	16	TIMER0_IC	; Timer 0 Input Capture
;	17	TIMER0_COMPA	; Timer 0 Compare Match A
;	18	TIMER0_COMPB	; Timer 0 Compare Match B
;	19	TIMER0_OVF	; Timer 0 Overflow
;	20	TWIBUSCD	; Two-Wire Bus Connect/Disconnect
;	21	TWI		; Two-Wire Serial Interface
;	22	SPI_STC		; SPI Serial transfer complete
;	23	VADC		; Voltage ADC Conversion Complete
;	24	CCADC_CONV	; Coulomb Counter ADC Conversion Complete
;	25	CCADC_REG_CUR	; Coloumb Counter ADC Regular Current
;	26	CCADC_ACC	; Coloumb Counter ADC Accumulator
;	27	EE_READY	; EEPROM Ready
;	28	SPM		; SPM Ready


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	INT_RESET	; RESET		 - External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;#		reti			; BPINT		 - Battery Protection Interrupt
;#		reti			; VREGMON	 - Voltage regulator monitor interrupt
;#		rjmp	INT_INT0	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; INT3		 - External Interrupt Request 3
;#		rjmp	INT_PCINT0	; PCINT0	 - Pin Change Interrupt 0
;#		reti			; PCINT1	 - Pin Change Interrupt 1
;#		reti			; WDT		 - Watchdog Timeout Interrupt
;#		reti			; BGSCD		 - Bandgap Buffer Short Circuit Detected
;#		reti			; CHDET		 - Charger Detect
;#		reti			; TIMER1_IC	 - Timer 1 Input capture
;#		reti			; TIMER1_COMPA	 - Timer 1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer 1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer 1 overflow
;#		reti			; TIMER0_IC	 - Timer 0 Input Capture
;#		reti			; TIMER0_COMPA	 - Timer 0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer 0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer 0 Overflow
;#		reti			; TWIBUSCD	 - Two-Wire Bus Connect/Disconnect
;#		reti			; TWI		 - Two-Wire Serial Interface
;#		reti			; SPI_STC	 - SPI Serial transfer complete
;#		reti			; VADC		 - Voltage ADC Conversion Complete
;#		reti			; CCADC_CONV	 - Coulomb Counter ADC Conversion Complete
;#		reti			; CCADC_REG_CUR	 - Coloumb Counter ADC Regular Current
;#		reti			; CCADC_ACC	 - Coloumb Counter ADC Accumulator
;#		rjmp	INT_EE_READY	; EE_READY	 - EEPROM Ready
;#		reti			; SPM		 - SPM Ready
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	INT_RESET:
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA32HVBREVB_INC_ */

; ************************ END OF FILE *********************************

